Nehesh-S/Study-Buddy/Microcontrollers/ESP8266/sensors_and_timer/src/main.cpp
#include <Arduino.h>
#include <DHT.h>
#include <ESP8266WiFi.h>
#include <WiFiClient.h>
#include <Arduino_JSON.h>
#include <Wire.h>
#include <Adafruit_GFX.h>
#include <Adafruit_SSD1306.h>
#include <Adafruit_ADS1X15.h>
#include <DFRobotDFPlayerMini.h>
#include <ReactESP.h>
#include <time.h>
#include <string.h>

using namespace reactesp;

// HTTP sync uses a raw WiFiClient (stable lwIP sockets), NOT the async
// ESPAsyncTCP stack — that stack null-derefs in its error handler on the ESP8266
// when a connection fails and hard-crashes the chip. We block only on connect()
// (bounded by CONNECT_TIMEOUT_MS); sending the request and reading the reply are
// done without blocking the loop (see syncToServer / pollSyncResponse).
#define CONNECT_TIMEOUT_MS 1000   // max blocking time while establishing the TCP connection
#define RESPONSE_TIMEOUT_MS 3000  // give up waiting for the reply after this (non-blocking)

const char* ssid = "laptop";
const char* password = "0987654321";

// Backend split into host/port/path so we can drive a raw socket ourselves.
const char* serverHost = "192.168.137.201";
const uint16_t serverPort = 8000;
const char* serverPath = "/api/esp8266-sync";

// Wall-clock: parsed once from the HTTP Date header (UTC). Add your local offset.
#define TZ_OFFSET_SECONDS (2 * 3600)  // UTC+2 = CEST (summer); use 1*3600 in winter

#define DHTPIN 2      //D4
#define DHTTYPE DHT22

#define POT_PIN A0        //          — potentiometer wiper (ESP8266's own ADC)
#define ADS_LDR_CHANNEL 0 // ADS1115 AIN0 — LDR divider (16-bit analog over I2C)
#define LDR_DARK_THRESHOLD 5000  // ldrValue below this = "dark" (tune to your lighting)

// Push buttons read via spare ADS1115 channels (all ESP GPIOs are used). Each
// button ties its AINx to 3V3 when pressed, a pull-down holds it near 0 V;
// anything above the threshold counts as pressed.
#define ADS_BUTTON_CHANNEL 1   // A1: suppress button (mutes blue blink in focus)
#define ADS_BUTTON2_CHANNEL 2  // A2: plays 06/ in break/idle/time
#define ADS_BUTTON3_CHANNEL 3  // A3: idle <-> time-state toggle
#define BUTTON_PRESS_THRESHOLD 10000  // ~1.25 V at GAIN_ONE (idle ~0, pressed ~26000)

// DFPlayer Mini (mini MP3 module) on the hardware UART. Escalation: if a
// distraction outlasts the blink/grace period, play a random track from the
// SD folder "01" (= your distracted sounds, files 001.mp3, 002.mp3, ...).
#define DFPLAYER_VOLUME 10         // 0..30 — moderate on purpose: high volume clips a
                                   // small speaker and spikes current (distortion/cutout)
#define DISTRACTED_FOLDER 1        // 01: nag sounds while distracted during focus
#define BREAK_END_FOLDER 2         // 02: last 2 s of break (focus about to start)
#define MISS_FOLDER 3              // 03: break start, did NOT beat the best distracted time
#define BEAT_FOLDER 4              // 04: break start, beat the best (new high score)
#define DARK_FOLDER 5              // 05: first time the LDR goes dark since boot
#define EXTRA_FOLDER 6             // 06: button 2 in break/idle/time
// Number of NNN.mp3 files in each folder — set these to your real file counts.
// (Picking a random track above the count would play silence.)
#define NUM_DISTRACTED_TRACKS 11
#define NUM_BREAK_END_TRACKS 1
#define NUM_MISS_TRACKS 1
#define NUM_BEAT_TRACKS 1
#define NUM_DARK_TRACKS 1
#define NUM_EXTRA_TRACKS 1
#define BLINK_CYCLES 2             // LED blinks this many distracted cycles, then audio fires
#define SUPPRESS_CYCLES 2          // a button press mutes the LED for this many cycles first
#define REPEAT_AUDIO_CYCLES 4      // after the first audio, re-play every this many distracted cycles

#define TOUCH1_PIN 13 //D7  — start focus timer / stop the cycle
#define TOUCH2_PIN 12 //D6  — cycle set mode (focus -> break -> idle)

// Traffic-light LEDs (active HIGH). GPIO15/D8 is a boot-strap pin, but an
// LED-to-GND holds it LOW at boot, which is the required state.
#define LED_RED_PIN 14    //D5
#define LED_YELLOW_PIN 16 //D0
#define LED_GREEN_PIN 15  //D8

// Alert LED (active HIGH) — blinks when the backend reports distracted/away.
// GPIO0/D3 is a boot-strap pin (must be HIGH at boot); an LED-to-GND is a light
// enough load that the pin's pull-up still boots normally.
#define LED_BLUE_PIN 0    //D3

// Fraction of a phase after which the yellow "about to switch" LED joins in.
#define LED_WARN_NUMERATOR 9
#define LED_WARN_DENOMINATOR 10

// Timer configuration
#define MIN_MINUTES 1
#define MAX_MINUTES 10
#define DEFAULT_MINUTES 1

#define SCREEN_WIDTH 128
#define SCREEN_HEIGHT 64
#define OLED_ADDR 0x3C
#define OLED_SDA 4  //D2
#define OLED_SCL 5  //D1

// Event cadences (milliseconds)
#define TOUCH_POLL_INTERVAL 20
#define UI_INTERVAL 200
#define SENSOR_READ_INTERVAL 2000
#define SYNC_INTERVAL 5000
#define CYCLE_SECONDS (SYNC_INTERVAL / 1000UL)  // distracted seconds counted per distracted reply
#define SYNC_POLL_INTERVAL 50
#define WIFI_MONITOR_INTERVAL 500
#define ALERT_BLINK_INTERVAL 250  // blue LED toggles at this rate = ~2 Hz blink
#define SUPPRESS_POLL_INTERVAL 150  // how often the suppress button is sampled

// A touch must read HIGH for this many consecutive polls (~60 ms) to count.
// Rejects brief glitches — e.g. TTP223 output blips when WiFi transmit spikes
// the supply — that a raw single-sample edge would wrongly accept as a touch.
#define TOUCH_CONFIRM_SAMPLES 3

Adafruit_SSD1306 display(SCREEN_WIDTH, SCREEN_HEIGHT, &Wire, -1);
DHT dht(DHTPIN, DHTTYPE);
Adafruit_ADS1115 ads;   // external 16-bit ADC on the shared I2C bus (addr 0x48)
bool adsReady = false;  // set true once ads.begin() succeeds
DFRobotDFPlayerMini dfplayer;  // mini MP3 module on the hardware UART (Serial)
bool dfReady = false;

ReactESP app;  // ReactESP 2.x — v3 dropped ESP8266 support (requires FreeRTOS)

// Reused socket for the backend sync + its non-blocking response state.
WiFiClient syncClient;
enum SyncState { SYNC_IDLE, SYNC_WAITING };  // WAITING = request sent, reply pending
SyncState syncState = SYNC_IDLE;
unsigned long syncSentAt = 0;
String syncResponse;  // accumulates the full HTTP reply as bytes trickle in

// Wall-clock, parsed once from the HTTP Date header (local epoch + a millis anchor).
bool timeSynced = false;
time_t syncedEpoch = 0;         // local epoch at the moment of sync
unsigned long syncedAtMillis = 0;

