Nehesh-S/Study-Buddy/Microcontrollers/ESP8266/sensors_and_timer/src/main.cpp
// Set from the backend's current_state: true while "distracted"/"away" so the
// blue LED blinks; false on "working". Consumed by blinkAlertLed().
bool alertActive = false;

// Distracted-escalation ladder (per distracted episode during focus):
//   blink for BLINK_CYCLES cycles -> play audio. A button press inserts
//   SUPPRESS_CYCLES muted cycles and restarts the blink count, delaying audio.
// Any non-distracted reply resets the whole thing.
int suppressCyclesLeft = 0;      // muted cycles remaining (LED off)
int blinkCyclesDone = 0;         // blinking cycles counted so far this ladder
bool audioPlayed = false;        // first audio has fired this ladder (LED then solid on)
int postAudioCycles = 0;         // distracted cycles since the last audio nag
bool isDistracted = false;       // last reply was "distracted"
bool buttonWasPressed = false;   // rising-edge state for the suppress button (A1)
bool button2WasPressed = false;  // rising-edge state for button 2 (A2)
bool button3WasPressed = false;  // rising-edge state for button 3 (A3)

// Distracted-time stats. sessionDistractedSeconds accumulates the current focus
// session's distracted time (CYCLE_SECONDS per distracted reply);
// minDistractedSeconds is the least of that across completed focus sessions.
unsigned long sessionDistractedSeconds = 0;
unsigned long minDistractedSeconds = 0xFFFFFFFFUL;  // sentinel: no session finished yet
bool breakEndAudioPlayed = false;  // "focus about to start" cue already fired this break
bool darkAudioPlayed = false;      // 05/ cue fired for the current dark spell; reset when light

// Tracks WiFi connection state so we can log transitions without blocking.
wl_status_t lastWifiStatus = WL_IDLE_STATUS;

// Latest sensor readings, refreshed by the sensor-read event and consumed
// by the display and sync events.
float humidity = 0.0;
float temperature = 0.0;
int ldrValue = 0;  // raw 16-bit ADS1115 reading (higher = brighter)

// --- Study Buddy timer state ----------------------------------------------

enum Mode {
  MODE_IDLE,       // stopped; shows the configured focus time
  MODE_FOCUS,      // focus timer counting down
  MODE_BREAK,      // break timer counting down
  MODE_SET_FOCUS,  // pot sets the focus duration
  MODE_SET_BREAK,  // pot sets the break duration
  MODE_TIME        // clock screen: day/date/time only (entered from idle via button 3)
};

Mode mode = MODE_IDLE;

int focusMinutes = DEFAULT_MINUTES;
int breakMinutes = DEFAULT_MINUTES;

unsigned long phaseStartMillis = 0;              // when the running phase began
unsigned long currentTimerSeconds = DEFAULT_MINUTES * 60UL;  // shown + synced value

// Focus pause (backend reports distracted/away). While paused we freeze the
// elapsed time at pausedElapsed; on resume phaseStartMillis is shifted forward
// so the countdown continues from exactly where it stopped.
bool timerPaused = false;
unsigned long pausedElapsed = 0;

// Touch confirmation state (TTP223 drives the line HIGH while touched).
int touch1Count = 0;
bool touch1Latched = false;
int touch2Count = 0;
bool touch2Latched = false;

bool touchDetected = false;  // sensor-1 touched since last sync (telemetry)

unsigned long focusDurationMs() { return (unsigned long)focusMinutes * 60UL * 1000UL; }
unsigned long breakDurationMs() { return (unsigned long)breakMinutes * 60UL * 1000UL; }

// Effective elapsed time in the running phase — frozen while paused.
unsigned long phaseElapsed() {
  return timerPaused ? pausedElapsed : (millis() - phaseStartMillis);
}

// Remaining whole seconds in the running phase, clamped so it never underflows.
unsigned long remainingSeconds(unsigned long durationMs) {
  unsigned long elapsed = phaseElapsed();
  if (elapsed >= durationMs) return 0;
  return (durationMs - elapsed) / 1000;
}

// Begin a fresh focus phase from the top, unpaused and assuming "working"
// until the backend says otherwise.
void startFocusPhase() {
  mode = MODE_FOCUS;
  phaseStartMillis = millis();
  timerPaused = false;
  alertActive = false;
  suppressCyclesLeft = 0;
  blinkCyclesDone = 0;
  audioPlayed = false;
  postAudioCycles = 0;
  isDistracted = false;
  sessionDistractedSeconds = 0;  // fresh distracted-time tally for this session
}

// Map the potentiometer to a whole number of minutes in [MIN, MAX].
int readPotMinutes() {
  int raw = analogRead(POT_PIN);
  return constrain(map(raw, 0, 1023, MIN_MINUTES, MAX_MINUTES), MIN_MINUTES, MAX_MINUTES);
}

// Print a duration as MM:SS at the current cursor.
void printMMSS(unsigned long totalSeconds) {
  unsigned long m = totalSeconds / 60;
  unsigned long s = totalSeconds % 60;
  if (m < 10) display.print('0');
  display.print(m);
  display.print(':');
  if (s < 10) display.print('0');
  display.print(s);
}

// Current local wall-clock epoch, free-running from the one-time Date sync.
time_t currentEpoch() {
  return syncedEpoch + (time_t)((millis() - syncedAtMillis) / 1000UL);
}

// Print a string horizontally centred on the 128 px display at row y.
void printCentered(const char* s, int y, int size) {
  int w = (int)strlen(s) * 6 * size;
  int x = (128 - w) / 2;
  if (x < 0) x = 0;
  display.setTextSize(size);
  display.setCursor(x, y);
  display.print(s);
}

// Time-state screen: day of week, date, and time — nothing else.
void renderClock() {
  if (!timeSynced) {
    printCentered("Time not set", 28, 1);
    return;
  }
  static const char* const DAYS[] =
      {"Sunday", "Monday", "Tuesday", "Wednesday", "Thursday", "Friday", "Saturday"};
  static const char* const MONS[] =
      {"Jan", "Feb", "Mar", "Apr", "May", "Jun", "Jul", "Aug", "Sep", "Oct", "Nov", "Dec"};

  time_t now = currentEpoch();
  struct tm* t = gmtime(&now);  // already local (offset folded in at sync)

  char buf[16];
  printCentered(DAYS[t->tm_wday], 4, 2);
  snprintf(buf, sizeof(buf), "%d %s %d", t->tm_mday, MONS[t->tm_mon], t->tm_year + 1900);
  printCentered(buf, 26, 1);
  snprintf(buf, sizeof(buf), "%02d:%02d", t->tm_hour, t->tm_min);
  printCentered(buf, 40, 3);
}

void updateDisplay(const char* label, unsigned long timerSeconds) {
  display.clearDisplay();
  display.setTextColor(SSD1306_WHITE);

  if (mode == MODE_TIME) {  // clock screen only
    renderClock();
    display.display();
    return;
  }

