Nehesh-S/Study-Buddy/Microcontrollers/ESP8266/sensors_and_timer/src/main.cpp
  display.setTextSize(1);
  display.setCursor(0, 0);
  display.print(label);

  display.setTextSize(3);
  display.setCursor(10, 24);
  unsigned long mins = timerSeconds / 60;
  unsigned long secs = timerSeconds % 60;
  if (mins < 10) display.print("0");
  display.print(mins);
  display.print(":");
  if (secs < 10) display.print("0");
  display.print(secs);

  // Bottom line: distracted-time stat. During focus, this session's distracted
  // time; during break, the least distracted time across finished sessions.
  display.setTextSize(1);
  display.setCursor(0, 56);
  if (mode == MODE_FOCUS) {
    display.print("Distr ");
    printMMSS(sessionDistractedSeconds);
  } else if (mode == MODE_BREAK) {
    display.print("Best ");
    if (minDistractedSeconds == 0xFFFFFFFFUL) display.print("--:--");
    else printMMSS(minDistractedSeconds);
  }

  display.display();
}

// --- Events ---------------------------------------------------------------

// Confirmed rising-edge: returns true once per press, after the line has been
// HIGH for TOUCH_CONFIRM_SAMPLES consecutive polls. A single-sample glitch
// never reaches the threshold, so it is ignored.
bool touchPressed(uint8_t pin, int& stableCount, bool& latched) {
  if (digitalRead(pin) == HIGH) {
    if (stableCount < TOUCH_CONFIRM_SAMPLES) stableCount++;
    if (stableCount >= TOUCH_CONFIRM_SAMPLES && !latched) {
      latched = true;  // fire once; stays latched until released
      return true;
    }
  } else {
    stableCount = 0;
    latched = false;  // released — arm for the next press
  }
  return false;
}

// Touch 1: start the focus cycle from idle, or stop it back to idle.
void checkTouch1() {
  if (!touchPressed(TOUCH1_PIN, touch1Count, touch1Latched)) return;

  touchDetected = true;
  if (mode == MODE_IDLE) {
    startFocusPhase();
    Serial.println("Touch 1 — focus timer started");
  } else if (mode == MODE_FOCUS || mode == MODE_BREAK) {
    mode = MODE_IDLE;  // stop the cycle and return to idle
    Serial.println("Touch 1 — cycle stopped, idle");
  }
  // In set mode Touch 1 is ignored; use Touch 2 to finish setting.
}

// Touch 2: cycle through the set-mode screens (focus -> break -> idle).
void checkTouch2() {
  if (!touchPressed(TOUCH2_PIN, touch2Count, touch2Latched)) return;

  if (mode == MODE_SET_FOCUS) {
    mode = MODE_SET_BREAK;
    Serial.println("Touch 2 — setting BREAK timer");
  } else if (mode == MODE_SET_BREAK) {
    mode = MODE_IDLE;
    Serial.print("Touch 2 — saved. Focus=");
    Serial.print(focusMinutes);
    Serial.print("min Break=");
    Serial.print(breakMinutes);
    Serial.println("min");
  } else if (mode == MODE_IDLE) {  // set mode is only reachable from idle
    mode = MODE_SET_FOCUS;
    Serial.println("Touch 2 — setting FOCUS timer");
  } else {  // FOCUS or BREAK running: Touch 2 is locked out, only Touch 1 resets
    Serial.println("Touch 2 ignored — timer running");
  }
}

// Drive the traffic-light LEDs from the current phase and its progress:
//   FOCUS  first 90% -> red;            last 10% -> red + yellow
//   BREAK  first 90% -> green;          last 10% -> green + yellow
//   IDLE / SET modes -> all off.
void updateLeds() {
  bool red = false, yellow = false, green = false;

  if (mode == MODE_FOCUS) {
    red = true;
    unsigned long warnAt = focusDurationMs() * LED_WARN_NUMERATOR / LED_WARN_DENOMINATOR;
    if (phaseElapsed() >= warnAt) yellow = true;
  } else if (mode == MODE_BREAK) {
    green = true;
    unsigned long warnAt = breakDurationMs() * LED_WARN_NUMERATOR / LED_WARN_DENOMINATOR;
    if (phaseElapsed() >= warnAt) yellow = true;
  }

  digitalWrite(LED_RED_PIN, red ? HIGH : LOW);
  digitalWrite(LED_YELLOW_PIN, yellow ? HIGH : LOW);
  digitalWrite(LED_GREEN_PIN, green ? HIGH : LOW);
}

// Play a random NNN.mp3 (1..numTracks) from the given SD folder.
void playRandomFromFolder(uint8_t folder, uint8_t numTracks) {
  if (!dfReady) return;
  dfplayer.playFolder(folder, random(1, numTracks + 1));
}

// Advance the focus/break cycle, apply the pot in set mode, and repaint.
void updateUI() {
  // Time state: no timer logic — just draw the clock and keep the LEDs off.
  if (mode == MODE_TIME) {
    updateDisplay(nullptr, 0);
    updateLeds();
    return;
  }

  // 1) Pause/resume the focus countdown from the backend's camera state. Only
  //    focus is affected; break/idle ignore it. Freezing elapsed here stops the
  //    phase from advancing below.
  bool shouldPause = (mode == MODE_FOCUS && alertActive);
  if (shouldPause && !timerPaused) {
    pausedElapsed = millis() - phaseStartMillis;
    timerPaused = true;
    Serial.println("Focus paused — distracted/away");
  } else if (!shouldPause && timerPaused) {
    phaseStartMillis = millis() - pausedElapsed;  // continue where we stopped
    timerPaused = false;
    Serial.println("Focus resumed — working");
  }

  // 2) Advance the running phases; when one ends, the other starts automatically.
  //    phaseElapsed() is frozen while paused, so a paused focus never expires.
  if (mode == MODE_FOCUS && phaseElapsed() >= focusDurationMs()) {
    // Did this session beat the previous best? Compare before folding it in.
    bool beatBest = (minDistractedSeconds != 0xFFFFFFFFUL) &&
                    (sessionDistractedSeconds < minDistractedSeconds);
    if (sessionDistractedSeconds < minDistractedSeconds) {
      minDistractedSeconds = sessionDistractedSeconds;  // new/first best
    }
    if (beatBest) playRandomFromFolder(BEAT_FOLDER, NUM_BEAT_TRACKS);   // high score!
    else          playRandomFromFolder(MISS_FOLDER, NUM_MISS_TRACKS);   // didn't beat it
    mode = MODE_BREAK;
    phaseStartMillis = millis();
    breakEndAudioPlayed = false;  // arm the "focus about to start" cue
    Serial.println("Focus finished — break started");
  } else if (mode == MODE_BREAK && phaseElapsed() >= breakDurationMs()) {
    startFocusPhase();
    Serial.println("Break finished — focus started");
  }

  // Break-ending cue: play the "focus about to start" sound once in the last 2 s.
  if (mode == MODE_BREAK && !breakEndAudioPlayed &&
      remainingSeconds(breakDurationMs()) <= 2) {
    playRandomFromFolder(BREAK_END_FOLDER, NUM_BREAK_END_TRACKS);
    breakEndAudioPlayed = true;
  }

  // 3) In set mode the value snaps to the potentiometer position.
  if (mode == MODE_SET_FOCUS) {
    focusMinutes = readPotMinutes();
  } else if (mode == MODE_SET_BREAK) {
    breakMinutes = readPotMinutes();
  }

  // 4) Decide what to show.
  const char* label;
  unsigned long showSeconds;
  switch (mode) {
    case MODE_FOCUS:
      label = timerPaused ? "FOCUS PAUSED" : "FOCUS";
      showSeconds = remainingSeconds(focusDurationMs());
      break;
    case MODE_BREAK:
      label = "BREAK";
      showSeconds = remainingSeconds(breakDurationMs());
      break;
    case MODE_SET_FOCUS:
      label = "SET FOCUS";
      showSeconds = focusMinutes * 60UL;
      break;
    case MODE_SET_BREAK:
      label = "SET BREAK";
      showSeconds = breakMinutes * 60UL;
      break;
    case MODE_IDLE:
    default:
      label = "READY";
      showSeconds = focusMinutes * 60UL;
      break;
  }

  currentTimerSeconds = showSeconds;
  updateDisplay(label, showSeconds);
  updateLeds();
}

// Read the DHT22 and the digital LDR. Keeps last good DHT values on a failed read.
void readSensors() {
  // DIAGNOSTIC: watch the heap trend. A steady decline every cycle = a leak
  // (prime suspect: the async HTTP path) and the eventual crash is heap starvation.
  Serial.print("Heap: ");
  Serial.print(ESP.getFreeHeap());

