Nehesh-S/Study-Buddy/Microcontrollers/ESP8266/sensors_and_timer/src/main.cpp
  float h = dht.readHumidity();
  float t = dht.readTemperature();
  if (adsReady) {
    ldrValue = ads.readADC_SingleEnded(ADS_LDR_CHANNEL);  // 16-bit, ~few ms
    // Edge-triggered dark cue: play once when it goes dark, re-arm when it's
    // light again. So staying dark plays once; dark->light->dark plays twice.
    if (ldrValue < LDR_DARK_THRESHOLD) {
      if (!darkAudioPlayed) {
        playRandomFromFolder(DARK_FOLDER, NUM_DARK_TRACKS);
        darkAudioPlayed = true;
      }
    } else {
      darkAudioPlayed = false;  // back in the light — arm for the next dark spell
    }
  }

  if (isnan(h) || isnan(t)) {
    Serial.println("\tError: Unable to read data from DHT sensor.");
    return;
  }
  humidity = h;
  temperature = t;

  Serial.print("\t Humidity: ");
  Serial.print(humidity);
  Serial.print(" %\t Temperature: ");
  Serial.print(temperature);
  Serial.print(" °C\t LDR: ");
  Serial.print(ldrValue);
  Serial.print(" (");
  Serial.print(ads.computeVolts(ldrValue), 3);
  Serial.println(" V)");
}

// Open the connection and fire off the POST, then hand the reply to
// pollSyncResponse(). Only connect() may block (bounded by CONNECT_TIMEOUT_MS);
// writing the request goes into the socket buffer and returns immediately.
void syncToServer() {
  if (WiFi.status() != WL_CONNECTED) {
    Serial.println("WiFi Disconnected");
    return;
  }

  // A reply from the previous sync is still pending — let the poller finish it.
  if (syncState != SYNC_IDLE) {
    Serial.println("Previous sync still awaiting reply — skipping");
    return;
  }

  JSONVar doc;
  doc["humidity"] = humidity;
  doc["temperature"] = temperature;
  doc["timer_value"] = (int)currentTimerSeconds;
  doc["ldr_value"] = ldrValue;
  doc["button_pressed"] = touchDetected;

  String jsonBody = JSON.stringify(doc);

  // Blocking connect — acceptable, and bounded by the timeout.
  syncClient.setTimeout(CONNECT_TIMEOUT_MS);
  if (!syncClient.connect(serverHost, serverPort)) {
    Serial.println("Sync connect failed");
    syncClient.stop();
    return;  // keep touchDetected set so the next cycle retries
  }

  // Send the request without waiting for the response.
  syncClient.print(F("POST "));
  syncClient.print(serverPath);
  syncClient.print(F(" HTTP/1.1\r\nHost: "));
  syncClient.print(serverHost);
  syncClient.print(':');
  syncClient.print(serverPort);
  syncClient.print(F("\r\nContent-Type: application/json\r\nContent-Length: "));
  syncClient.print(jsonBody.length());
  syncClient.print(F("\r\nConnection: close\r\n\r\n"));
  syncClient.print(jsonBody);

  syncState = SYNC_WAITING;
  syncSentAt = millis();
  syncResponse = "";
  syncResponse.reserve(256);
  touchDetected = false;  // request is on its way
}

// Play a random track from the distracted-sounds folder on the DFPlayer's SD.
void playDistractedAudio() {
  playRandomFromFolder(DISTRACTED_FOLDER, NUM_DISTRACTED_TRACKS);
}

// Parse the reply body and act on current_state ("working"/"distracted"/"away").
// Only the focus phase cares about the camera state — break/idle ignore it.
void handleSyncResponse() {
  if (mode != MODE_FOCUS) return;

  // Grab the JSON object out of the raw reply (robust to headers / chunking).
  int start = syncResponse.indexOf('{');
  int end = syncResponse.lastIndexOf('}');
  if (start < 0 || end <= start) {
    Serial.println("Sync reply: no JSON body");
    return;
  }

  JSONVar doc = JSON.parse(syncResponse.substring(start, end + 1));
  if (JSON.typeof(doc) == "undefined" || !doc.hasOwnProperty("current_state")) {
    Serial.println("Sync reply: bad JSON / no current_state");
    return;
  }

  String state = (const char*)doc["current_state"];
  bool distracted = (state == "distracted");
  alertActive = distracted || (state == "away");  // drives the focus pause

  if (distracted) {
    isDistracted = true;
    sessionDistractedSeconds += CYCLE_SECONDS;  // count this distracted cycle
    if (suppressCyclesLeft > 0) {
      suppressCyclesLeft--;             // muted cycle: LED off, ladder frozen
    } else if (!audioPlayed) {
      blinkCyclesDone++;                // a blinking cycle
      if (blinkCyclesDone > BLINK_CYCLES) {
        playDistractedAudio();          // blinked long enough -> escalate to sound
        audioPlayed = true;
        postAudioCycles = 0;            // start the re-nag counter (LED now solid on)
      }
    } else {
      // Past the first audio: LED stays solid on; re-play periodically.
      postAudioCycles++;
      if (postAudioCycles >= REPEAT_AUDIO_CYCLES) {
        playDistractedAudio();
        postAudioCycles = 0;
      }
    }
  } else {
    // "working" or "away" — anything but distracted resets the ladder.
    isDistracted = false;
    suppressCyclesLeft = 0;
    blinkCyclesDone = 0;
    audioPlayed = false;
    postAudioCycles = 0;
  }

  Serial.print("current_state: ");
  Serial.print(state);
  Serial.println(alertActive ? "  -> ALERT" : "  -> working");
}

// Days since the Unix epoch for a civil date (Howard Hinnant's algorithm).
long daysFromCivil(int y, int m, int d) {
  y -= m <= 2;
  long era = (y >= 0 ? y : y - 399) / 400;
  int yoe = (int)(y - era * 400);
  int doy = (153 * (m + (m > 2 ? -3 : 9)) + 2) / 5 + d - 1;
  int doe = yoe * 365 + yoe / 4 - yoe / 100 + doy;
  return era * 146097L + doe - 719468;
}

// Set the wall-clock once from the reply's HTTP "Date:" header (RFC 7231 UTC,
// e.g. "Sun, 13 Jul 2026 18:22:04 GMT"). No backend change needed — every HTTP
// server adds this header automatically.
void syncClockFromResponse() {
  int idx = syncResponse.indexOf("Date:");
  if (idx < 0) idx = syncResponse.indexOf("date:");
  if (idx < 0) return;

  int day, year, hh, mm, ss;
  char mon[4] = {0};
  const char* p = syncResponse.c_str() + idx + 5;
  if (sscanf(p, " %*3s, %d %3s %d %d:%d:%d", &day, mon, &year, &hh, &mm, &ss) != 6) return;

  static const char months[] = "JanFebMarAprMayJunJulAugSepOctNovDec";
  const char* mp = strstr(months, mon);
  if (!mp) return;
  int month = (int)((mp - months) / 3) + 1;

  time_t utc = (time_t)daysFromCivil(year, month, day) * 86400L +
               (time_t)hh * 3600L + mm * 60L + ss;
  syncedEpoch = utc + TZ_OFFSET_SECONDS;
  syncedAtMillis = millis();
  timeSynced = true;
}

// Non-blocking reply handler: reads only bytes already available, so it never
// waits on the network. Accumulates the full reply, then parses it on close.
void pollSyncResponse() {
  if (syncState != SYNC_WAITING) return;

  while (syncClient.available()) {
    syncResponse += (char)syncClient.read();
  }

  // Peer closed (we sent "Connection: close") or we ran out of patience.
  bool closed = !syncClient.connected();
  bool timedOut = millis() - syncSentAt > RESPONSE_TIMEOUT_MS;
  if (closed || timedOut) {
    if (syncResponse.length() > 0) {
      if (!timeSynced) syncClockFromResponse();  // one-time wall-clock from Date header
      handleSyncResponse();
    } else {
      Serial.println("Sync reply timed out (no data)");
    }
    syncClient.stop();
    syncState = SYNC_IDLE;
  }
}

