Nehesh-S/Study-Buddy/Microcontrollers/ESP8266/sensors_and_timer/src/main.cpp
// Drive the blue LED for the distracted ladder (while distracted, in focus, and
// not button-muted): blink during the pre-audio stage, then hold solid on after
// the audio fires as a steady distracted-status indicator.
void blinkAlertLed() {
  static bool on = false;
  bool active = isDistracted && mode == MODE_FOCUS && suppressCyclesLeft == 0;
  if (!active) {
    on = false;
    digitalWrite(LED_BLUE_PIN, LOW);
    return;
  }
  if (audioPlayed) {
    on = true;                              // solid on after escalation
    digitalWrite(LED_BLUE_PIN, HIGH);
  } else {
    on = !on;                               // blinking before escalation
    digitalWrite(LED_BLUE_PIN, on ? HIGH : LOW);
  }
}

// Rising-edge press on an ADS button channel. The ~150 ms sample rate also
// debounces the mechanical contacts.
bool adsButtonPressed(uint8_t channel, bool& wasPressed) {
  bool pressed = ads.readADC_SingleEnded(channel) > BUTTON_PRESS_THRESHOLD;
  bool edge = pressed && !wasPressed;
  wasPressed = pressed;
  return edge;
}

// Button 1 (A1): only relevant in focus — a press mutes the blue blink and
// restarts the escalation ladder (mute, re-blink, then audio).
void checkSuppressButton() {
  if (!adsReady || mode != MODE_FOCUS) { buttonWasPressed = false; return; }
  if (adsButtonPressed(ADS_BUTTON_CHANNEL, buttonWasPressed)) {
    suppressCyclesLeft = SUPPRESS_CYCLES;  // mute N cycles...
    blinkCyclesDone = 0;                   // ...then blink N cycles again...
    audioPlayed = false;                   // ...before audio can fire
    Serial.println("Suppress button — mute, re-blink, then audio");
  }
}

// Buttons 2 (A2) and 3 (A3): only relevant in idle/break/time.
//   Button 2 -> play a random 06/ track.
//   Button 3 -> toggle idle <-> time state (does nothing in break).
void checkModeButtons() {
  bool active = (mode == MODE_IDLE || mode == MODE_BREAK || mode == MODE_TIME);
  if (!adsReady || !active) {
    button2WasPressed = false;
    button3WasPressed = false;
    return;
  }
  if (adsButtonPressed(ADS_BUTTON2_CHANNEL, button2WasPressed)) {
    playRandomFromFolder(EXTRA_FOLDER, NUM_EXTRA_TRACKS);
    Serial.println("Button 2 — play 06/");
  }
  if (adsButtonPressed(ADS_BUTTON3_CHANNEL, button3WasPressed)) {
    if (mode == MODE_IDLE) {
      mode = MODE_TIME;
      Serial.println("Button 3 — time state");
    } else if (mode == MODE_TIME) {
      mode = MODE_IDLE;
      Serial.println("Button 3 — back to idle");
    }  // in break: button 3 does nothing
  }
}

// Log WiFi connect/disconnect transitions without blocking startup.
void monitorWiFi() {
  wl_status_t status = WiFi.status();
  if (status == lastWifiStatus) return;

  if (status == WL_CONNECTED) {
    Serial.print("Connected to WiFi network with IP Address: ");
    Serial.println(WiFi.localIP());
  } else {
    Serial.println("WiFi not connected...");
  }
  lastWifiStatus = status;
}

// --------------------------------------------------------------------------

void setup() {
  // The hardware UART now drives the DFPlayer Mini (9600 baud, fixed), so the
  // USB serial monitor is no longer usable — debug prints still go out but are
  // ignored by the module (they contain no 0x7E frame-start byte).
  Serial.begin(9600);

  // Command-only link to the MP3 module (isACK=false: we don't read its replies).
  dfReady = dfplayer.begin(Serial, false, false);
  dfplayer.volume(DFPLAYER_VOLUME);
  randomSeed(micros());

  dht.begin();

  pinMode(TOUCH1_PIN, INPUT);  // TTP223 actively drives the line
  pinMode(TOUCH2_PIN, INPUT);

  pinMode(LED_RED_PIN, OUTPUT);
  pinMode(LED_YELLOW_PIN, OUTPUT);
  pinMode(LED_GREEN_PIN, OUTPUT);
  pinMode(LED_BLUE_PIN, OUTPUT);
  digitalWrite(LED_RED_PIN, LOW);
  digitalWrite(LED_YELLOW_PIN, LOW);
  digitalWrite(LED_GREEN_PIN, LOW);
  digitalWrite(LED_BLUE_PIN, LOW);

  Wire.begin(OLED_SDA, OLED_SCL);
  if (!display.begin(SSD1306_SWITCHCAPVCC, OLED_ADDR)) {
    Serial.println("SSD1306 init failed");
  } else {
    display.clearDisplay();
    display.display();
  }

  // External ADC for the LDR (shares the I2C bus; default address 0x48).
  if (ads.begin()) {
    ads.setGain(GAIN_ONE);  // ±4.096 V full scale — LDR node tops out at 3.3 V
    adsReady = true;
    Serial.println("ADS1115 ready");
  } else {
    Serial.println("ADS1115 not found (check wiring / ADDR->GND for 0x48)");
  }

  // Kick off the WiFi connection but don't block on it; monitorWiFi() reports
  // the outcome and the SDK keeps retrying in the background.
  WiFi.mode(WIFI_STA);
  WiFi.setAutoReconnect(true);
  WiFi.begin(ssid, password);
  Serial.println("Connecting to WiFi in background...");

  // Register the event-loop tasks.
  app.onRepeat(TOUCH_POLL_INTERVAL, checkTouch1);
  app.onRepeat(TOUCH_POLL_INTERVAL, checkTouch2);
  app.onRepeat(UI_INTERVAL, updateUI);
  app.onRepeat(SENSOR_READ_INTERVAL, readSensors);
  app.onRepeat(SYNC_INTERVAL, syncToServer);
  app.onRepeat(SYNC_POLL_INTERVAL, pollSyncResponse);
  app.onRepeat(ALERT_BLINK_INTERVAL, blinkAlertLed);
  app.onRepeat(SUPPRESS_POLL_INTERVAL, checkSuppressButton);
  app.onRepeat(SUPPRESS_POLL_INTERVAL, checkModeButtons);
  app.onRepeat(WIFI_MONITOR_INTERVAL, monitorWiFi);
}

void loop() {
  app.tick();
}
